app/views/articles/show.html.erb

helpful later. Who knows? Chissa?
<% @article.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 30]]