app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?)
---
  def create
    @article = Article.new(article_params)
    #We are now using article_params because typing in every parameter one by
    #one every time they are needed is bound to cause big problems later on.
    #It is better to just cover all of them with a simple 'article_params'.
    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "Hanno creduto, cercato e voluto che fosse cosi!"], ["updated_at", "2022-09-08 03:53:01.491190"], ["id", 28]]
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)